#+TITLE: EMO-konijn
#+STARTUP: inlineimages

* 3 De EMOkonijntjes, getekend met Python

In deze sectie heb ik de konijnen voor het eerst uitgetekend met behulp van python in codeblocks.

#+name: EMOkonijntjes
#+begin_src python :results output
oren=    " ()_()  "
poten=   '(") (") '
lichaam=[" (o.o) ", " (X.X) ", " (...) ", " (*.*) ", " (0.0) ",
         " (o.-) ", " (-.0) ", " (o.0) ", " (#.#) ", " (~.~) ",
         " (>.<) ", " (,.,) ", " (o^o) ", " (`.`) ", " ('.') "]
teller=0

print ("De lijst van bunnies\n")
for y in range(0,3):
  # Drie maal herhalen want er zijn drie rijen van 5
  # For loop die vijf bunnies print naast elkaar, daarom
  # staan in de volgende print rijen vijf entries.
  # De range is drie omdat de array bestaat uit 15 (15/5=3)
  print (5* oren)
  print (lichaam[(y*5)],lichaam[(y*5)+1], lichaam[(y*5)+2],lichaam[(y*5)+3], lichaam[(y*5)+4])
  print (5* poten, "")
  print ()
#+end_src

#+RESULTS: EMOkonijntjes
#+begin_example
De lijst van bunnies

 ()_()   ()_()   ()_()   ()_()   ()_()
 (o.o)   (X.X)   (...)   (*.*)   (0.0)
(") (") (") (") (") (") (") (") (") (")

 ()_()   ()_()   ()_()   ()_()   ()_()
 (o.-)   (-.0)   (o.0)   (#.#)   (~.~)
(") (") (") (") (") (") (") (") (") (")

 ()_()   ()_()   ()_()   ()_()   ()_()
 (>.<)   (,x,)   (o^o)   (`.`)   ('.')
(") (") (") (") (") (") (") (") (") (")

#+end_example











